Catalogs/КлючиВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлючиВидовПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииГИСМТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииСАТУРН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииЗЕРНО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОписаниеНоменклатурыИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатурыИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕмкостьПотребительскойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВПотребительскойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантЧастичногоВыбытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияЕдиницыХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияЕдиницыХраненияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотребительскаяУпаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпаковкаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючВидовПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторыВидовПродукции</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникОписанияНоменклатурыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КлючиВидовПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Получает ключи видов продукции ИС.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.КлючиВидовПродукцииИС - ключ видов продукции.
//   * Значение - Структура из КлючИЗначение:
//      ** Ключ     - Строка - имя поля ключа.
//      ** Значение - СправочникСсылка.ВидыПродукцииИС- значение поля ключа.
//
Функция КлючиВидовПродукции() Экспорт
	
	Результат = Новый Соответствие;
	
	ИменаПолейКлючаСтрокой = СтрСоединить(КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции(), ",");
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ
	|	Ссылка,
	|	%1
	|ИЗ
	|	Справочник.КлючиВидовПродукцииИС
	|ГДЕ
	|	НЕ ПометкаУдаления",
	ИменаПолейКлючаСтрокой);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеКлюча = Новый Структура(ИменаПолейКлючаСтрокой);
		ЗаполнитьЗначенияСвойств(ДанныеКлюча, Выборка);
		Результат.Вставить(Выборка.Ссылка, ДанныеКлюча);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Структура полей ключа вида продукции
// 
// Возвращаемое значение:
//  Структура - поля ключа вида продукции:
// * ВидПродукцииГИСМТ - СправочникСсылка.ВидыПродукцииИС
// * ВидПродукцииЕГАИС - СправочникСсылка.ВидыПродукцииИС
// * ВидПродукцииВЕТИС - СправочникСсылка.ВидыПродукцииИС
// * ВидПродукцииСАТУРН - СправочникСсылка.ВидыПродукцииИС
// * ВидПродукцииЗЕРНО - СправочникСсылка.ВидыПродукцииИС
Функция ПоляКлюча() Экспорт
	
	ПоляКлюча = Новый Структура(СтрСоединить(КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции(), ","));
	
	Для Каждого КлючИЗначние Из ПоляКлюча Цикл
		ПоляКлюча[КлючИЗначние.Ключ] = Справочники.ВидыПродукцииИС.ПустаяСсылка();
	КонецЦикла;
	
	//@skip-check constructor-function-return-section
	Возврат ПоляКлюча;
	
КонецФункции
// Получает поля ключа по ключу.
//
// Параметры:
//   Ключ - СправочникСсылка.КлючиВидовПродукцииИС - ключ.
//
// Возвращаемое значение:
//  Структура - ключ структуры содержим имя ключа, значение содержит значение ключа.
Функция ПолучитьПоляКлюча(Ключ) Экспорт
	
	ИменаПолейКлючаСтрокой = СтрСоединить(КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции(), ",");
	
	Результат = Новый Структура(ИменаПолейКлючаСтрокой);
	
	Если ЗначениеЗаполнено(Ключ) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ключ);
		Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	%1
		|ИЗ
		|	Справочник.КлючиВидовПродукцииИС
		|ГДЕ
		|	Ссылка = &Ссылка",
		ИменаПолейКлючаСтрокой);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает ключ по полям ключа. Если ключ с такими полями отсутствует, то он будет создан.
//
// Параметры:
//   ПоляКлюча - см. ПоляКлюча
//
// Возвращаемое значение:
//   СправочникСсылка.КлючиВидовПродукцииИС - ключ.
Функция ПолучитьКлюч(ПоляКлюча) Экспорт
	
	Результат                   = ПустаяСсылка();
	Запрос                      = Новый Запрос;
	СтрокиОтбора                = Новый Массив;
	ЕстьДанныеДляПолученияКлюча = Ложь;
	
	Для Каждого ИмяПоляКлюча Из КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции() Цикл
		Если ПоляКлюча.Свойство(ИмяПоляКлюча) Тогда
			ЗначениеКлюча = ПоляКлюча[ИмяПоляКлюча];
			Если ЗначениеЗаполнено(ЗначениеКлюча)
				И ТипЗнч(ЗначениеКлюча) = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
				ЕстьДанныеДляПолученияКлюча = Истина;
			КонецЕсли;
		Иначе
			ЗначениеКлюча = Справочники.ВидыПродукцииИС.ПустаяСсылка();
		КонецЕсли;
		Запрос.УстановитьПараметр(ИмяПоляКлюча, ЗначениеКлюча);
		СтрокиОтбора.Добавить(СтрШаблон("%1 = &%1", ИмяПоляКлюча));
	КонецЦикла;
	
	Если ЕстьДанныеДляПолученияКлюча Тогда
		Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Справочник.КлючиВидовПродукцииИС
		|ГДЕ
		|	%1",
		СтрСоединить(СтрокиОтбора, " И "));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		Иначе
			Результат = СоздатьКлюч(ПоляКлюча);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает ключ по полям ключа.
//
// Параметры:
//   ПоляКлюча - см. ПоляКлюча
//   ОбновлятьПовторноИспользуемыеЗначения - Булево - признак обновления повторно используемых значений
// Возвращаемое значение:
//   СправочникСсылка.КлючиВидовПродукцииИС - ключ.
Функция СоздатьКлюч(ПоляКлюча, ОбновлятьПовторноИспользуемыеЗначения = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ключ = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Ключ, ПоляКлюча);
	Ключ.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ОбновлятьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	Возврат Ключ.Ссылка;
	
КонецФункции

// Ключ вида продукции по значению перечисления.
// 
// Параметры:
//  ЗначениеПеречисления - ПеречислениеСсылка.ВидыПродукцииИС
//  ДанныеКеша - Неопределено, Структура -
//  МаркируемаяПродукцияЕГАИС - Булево, Неопределено - признак маркируемости алкогольной продукции
//  ДанныеДляУточнения - см. ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДанныеДляУточненияТоварнойГруппы
//  МонопольнойДоступ - Булево - признак монопольного доступа к данным
// Возвращаемое значение:
//  СправочникСсылка.КлючиВидовПродукцииИС
Функция КлючПоЗначениюПеречисления(ЗначениеПеречисления, ДанныеКеша, МаркируемаяПродукцияЕГАИС, ДанныеДляУточнения = Неопределено, МонопольнойДоступ = Ложь) Экспорт
	
	ВозвращаемоеЗначение = ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(ЗначениеПеречисления) Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ДанныеКеша = Неопределено Тогда
		
		ДанныеКеша = Новый Структура();
		
		ВидыПродукцииВЕТИС  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииВетИС();
		ВидыПродукцииЕГАИС  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииЕГАИС();
		ВидыПродукцииЗЕРНО  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииЗЕРНО();
		ВидыПродукцииСАТУРН = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииСАТУРН();
		ВидыПродукцииГИСМТ  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ"));
		
		КлючиВидовПродукции               = КлючиВидовПродукции();
		ОписаниеТипаВидыПродукцииИС       = Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС");
		ОписаниеТипаКлючиВидовПродукцииИС = Новый ОписаниеТипов("СправочникСсылка.КлючиВидовПродукцииИС");
		
		ТаблицаКлючей = Новый ТаблицаЗначений();
		ТаблицаКлючей.Колонки.Добавить("Ссылка",             ОписаниеТипаКлючиВидовПродукцииИС);
		ТаблицаКлючей.Колонки.Добавить("ВидПродукцииВЕТИС",  ОписаниеТипаВидыПродукцииИС);
		ТаблицаКлючей.Колонки.Добавить("ВидПродукцииГИСМТ",  ОписаниеТипаВидыПродукцииИС);
		ТаблицаКлючей.Колонки.Добавить("ВидПродукцииЕГАИС",  ОписаниеТипаВидыПродукцииИС);
		ТаблицаКлючей.Колонки.Добавить("ВидПродукцииЗЕРНО",  ОписаниеТипаВидыПродукцииИС);
		ТаблицаКлючей.Колонки.Добавить("ВидПродукцииСАТУРН", ОписаниеТипаВидыПродукцииИС);
		
		ТаблицаКлючей.Индексы.Добавить("ВидПродукцииВЕТИС,ВидПродукцииГИСМТ,ВидПродукцииЕГАИС,ВидПродукцииЗЕРНО,ВидПродукцииСАТУРН");
		
		Для Каждого КлючИЗначение Из КлючиВидовПродукции Цикл
			
			НоваяСтрока = ТаблицаКлючей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючИЗначение.Значение);
			НоваяСтрока.Ссылка = КлючИЗначение.Ключ;
			
		КонецЦикла;
		
		ДанныеКеша.Вставить("ВидыПродукцииВЕТИС",  ВидыПродукцииВЕТИС);
		ДанныеКеша.Вставить("ВидыПродукцииГИСМТ",  ВидыПродукцииГИСМТ);
		ДанныеКеша.Вставить("ВидыПродукцииЕГАИС",  ВидыПродукцииЕГАИС);
		ДанныеКеша.Вставить("ВидыПродукцииЗЕРНО",  ВидыПродукцииЗЕРНО);
		ДанныеКеша.Вставить("ВидыПродукцииСАТУРН", ВидыПродукцииСАТУРН);
		ДанныеКеша.Вставить("ТаблицаКлючей",       ТаблицаКлючей);
		ДанныеКеша.Вставить("ВсеВидыПродукцииТоварнойГруппы", Новый Соответствие());
		ДанныеКеша.Вставить("КэшТНВЭДОКПД",                   Неопределено);
		ДанныеКеша.Вставить("УчитываемыеВидыПродукцииИСМП",   Новый Массив);
		ДанныеКеша.Вставить("ПодсистемаСуществуетИСМП",       ОбщегоНазначенияИС.ПодсистемаСуществует("ИСМП"));
		ДанныеКеша.Вставить("МодульОбщегоНазначенияИСМП",     ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ОбщегоНазначенияИСМП"));
		
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЗначениюПеречисления(
		ЗначениеПеречисления);
	
	ПоляКлюча = ПоляКлюча();
	
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		
		Если ДанныеКеша.ВидыПродукцииВЕТИС.Найти(ВидПродукции) <> Неопределено Тогда
			ПоляКлюча.ВидПродукцииВЕТИС = ВидПродукции;
		ИначеЕсли ДанныеКеша.ВидыПродукцииГИСМТ.Найти(ВидПродукции) <> Неопределено Тогда
			ПоляКлюча.ВидПродукцииГИСМТ = ВидПродукции;
		ИначеЕсли ДанныеКеша.ВидыПродукцииЕГАИС.Найти(ВидПродукции) <> Неопределено Тогда
			Если МаркируемаяПродукцияЕГАИС = Неопределено
				Или МаркируемаяПродукцияЕГАИС
				И КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ВидПродукции)
				Или Не МаркируемаяПродукцияЕГАИС
				И Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ВидПродукции) Тогда
				ПоляКлюча.ВидПродукцииЕГАИС = ВидПродукции;
			КонецЕсли;
		ИначеЕсли ДанныеКеша.ВидыПродукцииЗЕРНО.Найти(ВидПродукции) <> Неопределено Тогда
			ПоляКлюча.ВидПродукцииЗЕРНО = ВидПродукции;
		ИначеЕсли ДанныеКеша.ВидыПродукцииСАТУРН.Найти(ВидПродукции) <> Неопределено Тогда
			ПоляКлюча.ВидПродукцииСАТУРН = ВидПродукции;
		Иначе
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПоляКлюча.ВидПродукцииГИСМТ)
		И ДанныеКеша.ПодсистемаСуществуетИСМП Тогда
		ДанныеКеша.МодульОбщегоНазначенияИСМП.УточнитьВидПродукцииПоТНВЭДОКПД(
			ПоляКлюча.ВидПродукцииГИСМТ, ДанныеДляУточнения, ДанныеКеша);
	КонецЕсли;
	
	ПоискКлючей = ДанныеКеша.ТаблицаКлючей.НайтиСтроки(ПоляКлюча);
	Если ПоискКлючей.Количество() Тогда
		ВозвращаемоеЗначение = ПоискКлючей[0].Ссылка;
	Иначе
		Если МонопольнойДоступ Тогда
			ВозвращаемоеЗначение = СоздатьКлюч(ПоляКлюча, Ложь);
		Иначе
			ВозвращаемоеЗначение = ПолучитьКлюч(ПоляКлюча);
		КонецЕсли;
		НоваяСтрока = ДанныеКеша.ТаблицаКлючей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПоляКлюча);
		НоваяСтрока.Ссылка = ВозвращаемоеЗначение;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Значение перечисления ВидыПродукцииИС по ключу видов продукции.
// 
// Параметры:
//  КлючВидовПродукции - СправочникСсылка.КлючиВидовПродукцииИС
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыПродукцииИС
Функция ЗначениеПеречисленияПоКлючу(КлючВидовПродукции) Экспорт
	
	ТаблицаВидовПродукции = ОбщегоНазначенияИСПовтИсп.ТаблицаВидовПродукцииПеречислений();
	ПоляКлюча             = ПолучитьПоляКлюча(КлючВидовПродукции);
	ПоискСтрок            = ТаблицаВидовПродукции.НайтиСтроки(ПоляКлюча);
	
	Если ПоискСтрок.Количество() Тогда
		Возврат ПоискСтрок[0].Ссылка;
	Иначе
		Возврат Перечисления.ВидыПродукцииИС.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвртащает дубли ключей видов продукции после обмена РИБ
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - замененные объекты:
//   * Ключ - СправочникСсылка.КлючиВидовПродукцииИС - значение, которое необходимо заменить
//   * Значение - СправочникСсылка.КлючиВидовПродукцииИС - замененное которым необходимо заменить
Функция ДублиКлючейВидовПродукции() Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	
	Запрос         = Новый Запрос;
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	Таблица1.Ссылка             КАК Ссылка1,
		|	Таблица1.ВидПродукцииГИСМТ  КАК ВидПродукцииГИСМТ,
		|	Таблица1.ВидПродукцииЕГАИС  КАК ВидПродукцииЕГАИС,
		|	Таблица1.ВидПродукцииВЕТИС  КАК ВидПродукцииВЕТИС,
		|	Таблица1.ВидПродукцииСАТУРН КАК ВидПродукцииСАТУРН,
		|	Таблица1.ВидПродукцииЗЕРНО  КАК ВидПродукцииЗЕРНО,
		|	Таблица2.Ссылка             КАК Ссылка2
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	Справочник.КлючиВидовПродукцииИС КАК Таблица1
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиВидовПродукцииИС КАК Таблица2
		|	ПО
		|		Таблица1.ВидПродукцииГИСМТ    = Таблица2.ВидПродукцииГИСМТ
		|		И Таблица1.ВидПродукцииЕГАИС  = Таблица2.ВидПродукцииЕГАИС
		|		И Таблица1.ВидПродукцииВЕТИС  = Таблица2.ВидПродукцииВЕТИС
		|		И Таблица1.ВидПродукцииСАТУРН = Таблица2.ВидПродукцииСАТУРН
		|		И Таблица1.ВидПродукцииЗЕРНО  = Таблица2.ВидПродукцииЗЕРНО
		|		И Таблица1.Ссылка             <> Таблица2.Ссылка
		|		И НЕ Таблица2.ПометкаУдаления
		|ГДЕ
		|	НЕ Таблица1.ПометкаУдаления");
	
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсходныеДанные.Ссылка1            КАК Ссылка,
		|	ИсходныеДанные.ВидПродукцииГИСМТ  КАК ВидПродукцииГИСМТ,
		|	ИсходныеДанные.ВидПродукцииЕГАИС  КАК ВидПродукцииЕГАИС,
		|	ИсходныеДанные.ВидПродукцииВЕТИС  КАК ВидПродукцииВЕТИС,
		|	ИсходныеДанные.ВидПродукцииСАТУРН КАК ВидПродукцииСАТУРН,
		|	ИсходныеДанные.ВидПродукцииЗЕРНО  КАК ВидПродукцииЗЕРНО
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсходныеДанные.Ссылка2            КАК Ссылка,
		|	ИсходныеДанные.ВидПродукцииГИСМТ  КАК ВидПродукцииГИСМТ,
		|	ИсходныеДанные.ВидПродукцииЕГАИС  КАК ВидПродукцииЕГАИС,
		|	ИсходныеДанные.ВидПродукцииВЕТИС  КАК ВидПродукцииВЕТИС,
		|	ИсходныеДанные.ВидПродукцииСАТУРН КАК ВидПродукцииСАТУРН,
		|	ИсходныеДанные.ВидПродукцииЗЕРНО  КАК ВидПродукцииЗЕРНО
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные",
		"ИсходныеДанные");
	
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсходныеДанные.ВидПродукцииГИСМТ  КАК ВидПродукцииГИСМТ,
		|	ИсходныеДанные.ВидПродукцииЕГАИС  КАК ВидПродукцииЕГАИС,
		|	ИсходныеДанные.ВидПродукцииВЕТИС  КАК ВидПродукцииВЕТИС,
		|	ИсходныеДанные.ВидПродукцииСАТУРН КАК ВидПродукцииСАТУРН,
		|	ИсходныеДанные.ВидПродукцииЗЕРНО  КАК ВидПродукцииЗЕРНО
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные",
		"ПоляКлючей");
	
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-check bsl-legacy-check-string-literal
	КлючиПоПолям = РезультатыЗапроса["ПоляКлючей"].Выгрузить();
	//@skip-check bsl-legacy-check-string-literal
	ИсходныеДанные = РезультатыЗапроса["ИсходныеДанные"].Выгрузить();
	
	Если ИсходныеДанные.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ИсходныеДанные.Колонки.Добавить("КоличествоСсылок", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	РезультатыПоиска = НайтиПоСсылкам(ИсходныеДанные.ВыгрузитьКолонку("Ссылка"));
	РезультатыПоиска.Индексы.Добавить("Ссылка");
	
	Для Каждого СтрокаТаблицы Из КлючиПоПолям Цикл
		
		СтруктураПоиска = ПоляКлюча();
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		
		ПоискСтрок = ИсходныеДанные.Скопировать(СтруктураПоиска);
		Для Каждого НайденнаяСтрока Из ПоискСтрок Цикл
			СтруктураПоискаПоСсылкам = Новый Структура("Ссылка", НайденнаяСтрока.Ссылка);
			ПоискПоСсылкам = РезультатыПоиска.НайтиСтроки(СтруктураПоискаПоСсылкам);
			НайденнаяСтрока.КоличествоСсылок = ПоискПоСсылкам.Количество();
		КонецЦикла;
		ПоискСтрок.Сортировать("КоличествоСсылок Убыв");
		
		Заменитель = Неопределено;
		
		Для Каждого СтрокаПоиска Из ПоискСтрок Цикл
			
			Если Заменитель = Неопределено Тогда
				Заменитель = СтрокаПоиска.Ссылка;
			Иначе
				ВозвращаемоеЗначение.Вставить(СтрокаПоиска.Ссылка, Заменитель);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Строка данных поиска ключа по идентификатору.
// 
// Возвращаемое значение:
//  Структура - Строка данных поиска ключа по идентификатору:
// * Идентификатор - Строка - идентификатор вида продукции
// * ВидПродукции - СправочникСсылка.ВидыПродукцииИС - вид продукции
Функция СтрокаДанныхПоискаКлючаПоИдентификатору() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Идентификатор", "");
	ВозвращаемоеЗначение.Вставить("ВидПродукции",  Справочники.ВидыПродукцииИС.ПустаяСсылка());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
	
// Данные ключа по идентификаторам видов продукции.
// 
// Параметры:
//  Идентификаторы - Массив из см. СтрокаДанныхПоискаКлючаПоИдентификатору:
//   * Идентификатор - Строка - идентификатор вида продукции
//   * ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид продукции
//  ДанныеКеша - Неопределено, Структура - определить переменную за циклом
//  
// Возвращаемое значение:
//  Структура - Ключ или данные для сохранения идентификаторов видов продукции ключа:
// * КлючВидовПродукции - СправочникСсылка.КлючиВидовПродукцииИС - 
// * ИдентификаторыВидовПродукции - см. РегистрыСведений.ОписаниеНоменклатурыИС.ИдентификаторыВидовПродукцииКлюча
//                                - Неопределено
Функция ДанныеКлючаПоИдентификаторамВидовПродукции(Идентификаторы, ДанныеКеша) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("КлючВидовПродукции",           ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("ИдентификаторыВидовПродукции", Неопределено);
	
	ВидыПродукции                = Новый Массив;
	ИдентификаторыВидовПродукции = Новый Массив;
	ОтсутствуетВидПродукции      = Ложь;
	Если ДанныеКеша = Неопределено Тогда
		ДанныеКеша = Новый Структура();
		ДанныеКеша.Вставить("ВидыПродукцииПоИдентификатору", Новый Соответствие);
	КонецЕсли;
	
	Для Каждого СтрокаИдентификатора Из Идентификаторы Цикл
		
		Если ЗначениеЗаполнено(СтрокаИдентификатора.ВидПродукции) Тогда
			ВидыПродукции.Добавить(СтрокаИдентификатора.ВидПродукции);
		ИначеЕсли ЗначениеЗаполнено(СтрокаИдентификатора.Идентификатор) Тогда
			ВидПродукции = ДанныеКеша.ВидыПродукцииПоИдентификатору[СтрокаИдентификатора.Идентификатор];
			Если ВидПродукции = Неопределено Тогда
				ИдентификаторыВидовПродукции.Добавить(СтрокаИдентификатора.Идентификатор);
			Иначе
				ВидыПродукции.Добавить(СтрокаИдентификатора.ВидПродукции);
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИдентификаторыВидовПродукции.Количество() Тогда
		
		ВидыПродукцииПоИдентификаторам = Справочники.ВидыПродукцииИС.ВидыПродукцииПоИдентификаторам(ИдентификаторыВидовПродукции);
		
		Для Каждого СтрокаИдентификатора Из ИдентификаторыВидовПродукции Цикл
			
			ВидПродукции = ВидыПродукцииПоИдентификаторам[СтрокаИдентификатора];
			Если ЗначениеЗаполнено(ВидПродукции) Тогда
				ВидыПродукции.Добавить(ВидПродукции);
				ДанныеКеша.ВидыПродукцииПоИдентификатору[СтрокаИдентификатора] = ВидПродукции;
			Иначе
				ОтсутствуетВидПродукции = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОтсутствуетВидПродукции Тогда
		
		ВозвращаемоеЗначение.ИдентификаторыВидовПродукции = РегистрыСведений.ОписаниеНоменклатурыИС.ИдентификаторыВидовПродукцииКлюча();
		ВозвращаемоеЗначение.ИдентификаторыВидовПродукции.СтрокиИдентификаторов = Новый Массив;
		
		Для Каждого СтрокаИдентификатора Из Идентификаторы Цикл
		
			Если ЗначениеЗаполнено(СтрокаИдентификатора.Идентификатор) Тогда
				ВозвращаемоеЗначение.ИдентификаторыВидовПродукции.СтрокиИдентификаторов.Добавить(СтрокаИдентификатора.Идентификатор);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ПоляКлюча = ПоляКлюча();
		
		ВидыПродукцииВЕТИС  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииВетИС();
		ВидыПродукцииЕГАИС  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииЕГАИС();
		ВидыПродукцииЗЕРНО  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииЗЕРНО();
		ВидыПродукцииСАТУРН = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииСАТУРН();
		ВидыПродукцииГИСМТ  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение("Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ"));
		
		Для Каждого ВидПродукции Из ВидыПродукции Цикл
			
			Если ВидыПродукцииВЕТИС.Найти(ВидПродукции) <> Неопределено Тогда
				ПоляКлюча.ВидПродукцииВЕТИС = ВидПродукции;
			ИначеЕсли ВидыПродукцииГИСМТ.Найти(ВидПродукции) <> Неопределено Тогда
				ПоляКлюча.ВидПродукцииГИСМТ = ВидПродукции;
			ИначеЕсли ВидыПродукцииЕГАИС.Найти(ВидПродукции) <> Неопределено Тогда
				ПоляКлюча.ВидПродукцииЕГАИС = ВидПродукции;
			ИначеЕсли ВидыПродукцииЗЕРНО.Найти(ВидПродукции) <> Неопределено Тогда
				ПоляКлюча.ВидПродукцииЗЕРНО = ВидПродукции;
			ИначеЕсли ВидыПродукцииСАТУРН.Найти(ВидПродукции) <> Неопределено Тогда
				ПоляКлюча.ВидПродукцииСАТУРН = ВидПродукции;
			Иначе
				Возврат ВозвращаемоеЗначение;
			КонецЕсли;
			
		КонецЦикла;
		
		ВозвращаемоеЗначение.КлючВидовПродукции = ПолучитьКлюч(ПоляКлюча);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
	
#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ВидПродукцииГИСМТ");
	Поля.Добавить("ВидПродукцииЕГАИС");
	Поля.Добавить("ВидПродукцииВЕТИС");
	Поля.Добавить("ВидПродукцииСАТУРН");
	Поля.Добавить("ВидПродукцииЗЕРНО");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивПолей = Новый Массив;
	Для Каждого КлючИЗначение Из Данные Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			МассивПолей.Добавить(КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Представление = СтрСоединить(МассивПолей, ", ");
	
КонецПроцедуры

#КонецОбласти
